import * as cron from 'node-cron';

// Replace 'your_group_id' with the actual group ID where you want to send the message
const targetGroupId = '120363100535956262@g.us';

function getRandomMorning() {
    const greetings = [
        "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أعوذ بك مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر 🌟",
        "اللَّهمَّ بِكَ أصبحنا وبِكَ أمسينا وبِكَ نحيا وبِكَ نموتُ وإليْكَ المصيرُ 🌟",
        "أَصبَحْنا على فِطرةِ الإسلامِ، وعلى كَلِمةِ الإخلاصِ، وعلى دينِ نَبيِّنا محمَّدٍ صلَّى اللهُ عليه وسلَّمَ، وعلى مِلَّةِ أبينا إبراهيمَ حَنيفًا مُسلِمًا، وما كان مِنَ المُشرِكينَ 🌟",
        "لا إلهَ إلَّا اللهُ وحدَه لا شريكَ له له الملكُ وله الحمدُ وهو على كلِّ شيءٍ قديرٌ سبحان اللهِ والحمدُ للهِ ولا إلهَ إلَّا اللهُ واللهُ أكبرُ ولا حولَ ولا قوَّةَ إلَّا باللهِ العليِّ العظيمِ 🌟",
        "اللهم في هذا الصباح سخّر لنا من الدنيا ما تعلم أنه خيرٌ لنا، واصرف عنا كل ما فيه شر لنا. 🌟",
        "يا رب، أدعوك بعزتك وجلالك أن لا تصعّب لي حاجة ولا تعظم علي أمراً، ولا تحنِ لي قامة ولا تفضح لي سراً، ولا تكسر لي ظهراً. 🌟",
        "اللهم فوضتك أمري كله فجملة خيراً بما شئت، واجعلني يا رب ممن نظرت إليه فرحمته وسمعت دعاءه فأجبته. 🌟",
        "اللهم اجعل لنا من كل ضيق فرجاً، ومن كل هم مخرجاً، وارزقنا من حيث لا نحتسب. 🌟",
        "اللهم لا تجعل ابتلائي في جسدي ولا في أهلي ولا في مالي، اللهم اصرف عني الشر كله، ومن علي بالصحة والعافية. 🌟"
    ];
    const randomIndex = Math.floor(Math.random() * greetings.length);
    return greetings[randomIndex];
}

cron.schedule('0 7 * * *', () => {
    const randomMorning = getRandomMorning();
    conn.sendMessage(targetGroupId, {
        text: randomMorning
    })
});